mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xd/common/s6e1c3xd.h
/*******************************************************************************
* \brief Interrupt number definition for all type MCUs
*******************************************************************************/
#define FM_INTERRUPT_TYPE                         0x0130u

#define IRQ_NMI_AVAILABLE                         1
#define IRQ_HARDFAULT_AVAILABLE                   1
#define IRQ_SVC_AVAILABLE                         1
#define IRQ_PENDSV_AVAILABLE                      1
#define IRQ_SYSTICK_AVAILABLE                     1

#define IRQ_CSV_SWDT_LVD_AVAILABLE                1
#define IRQ_MFS0_RX_TX_AVAILABLE                  1
#define IRQ_MFS1_RX_TX_AVAILABLE                  1
#define IRQ_MFS3_RX_TX_AVAILABLE                  1
#define IRQ_MFS4_RX_TX_AVAILABLE                  1
#define IRQ_MFS6_RX_TX_I2CSLAVE_AVAILABLE         1
#define IRQ_MFS7_RX_TX_AVAILABLE                  1
#define IRQ_ADC0_AVAILABLE                        1
#define IRQ_USB0_F_ED123_AVAILABLE                1
#define IRQ_USB0_F_ED450I_AVAILABLE               1
#define IRQ_USB0_F_ED0O_ST_AVAILABLE              1
#define IRQ_USB0_H_AVAILABLE                      1
#define IRQ_TIM_AVAILABLE                         1
#define IRQ_WC_RTC_DT_AVAILABLE                   1
#define IRQ_EXINT0_1_AVAILABLE                    1
#define IRQ_EXINT2_3_AVAILABLE                    1
#define IRQ_EXINT4_5_AVAILABLE                    1
#define IRQ_EXINT6_7_AVAILABLE                    1
#define IRQ_EXINT8_AVAILABLE                      1
#define IRQ_EXINT12_13_AVAILABLE                  1
#define IRQ_EXINT15_AVAILABLE                     1
#define IRQ_BT0_4_AVAILABLE                       1
#define IRQ_BT1_5_AVAILABLE                       1
#define IRQ_BT2_6_AVAILABLE                       1
#define IRQ_BT3_7_AVAILABLE                       1
#define IRQ_HDMICEC0_1_AVAILABLE                  1
#define IRQ_SMCIF1_FLASHIF_AVAILABLE              1
#define IRQ_DSTC_AVAILABLE                        1


typedef enum IRQn
{
    NMI_IRQn                                      =  -14, /* Non Maskable Interrupt NMI */
    HardFault_IRQn                                =  -13, /* HardFault HardFault */
    SVC_IRQn                                      =   -5, /* SV Call SVC */
    PendSV_IRQn                                   =   -2, /* Pend SV PendSV */
    SysTick_IRQn                                  =   -1, /* System Tick SysTick */

    CSV_SWDT_LVD_IRQn                             =    0, /* CSV_SWDT_LVD_IRQ */
    MFS0_RX_TX_IRQn                               =    1, /* MFS0_RX_TX_IRQ */
    MFS1_RX_TX_IRQn                               =    2, /* MFS1_RX_TX_IRQ */
    MFS3_RX_TX_IRQn                               =    4, /* MFS3_RX_TX_IRQ */
    MFS4_RX_TX_IRQn                               =    5, /* MFS4_RX_TX_IRQ */
    MFS6_RX_TX_I2CSLAVE_IRQn                      =    7, /* MFS6_RX_TX_I2CSLAVE_IRQ */
    MFS7_RX_TX_IRQn                               =    8, /* MFS7_RX_TX_IRQ */
    ADC0_IRQn                                     =    9, /* ADC0_IRQ */
    USB0_F_ED123_IRQn                             =   10, /* USB0_F_ED123_IRQ */
    USB0_F_ED450I_IRQn                            =   11, /* USB0_F_ED450I_IRQ */
    USB0_F_ED0O_ST_IRQn                           =   12, /* USB0_F_ED0O_ST_IRQ */
    USB0_H_IRQn                                   =   13, /* USB0_H_IRQ */
    TIM_IRQn                                      =   14, /* TIM_IRQ */
    WC_RTC_DT_IRQn                                =   15, /* WC_RTC_DT_IRQ */
    EXINT0_1_IRQn                                 =   16, /* EXINT0_1_IRQ */
    EXINT2_3_IRQn                                 =   17, /* EXINT2_3_IRQ */
    EXINT4_5_IRQn                                 =   18, /* EXINT4_5_IRQ */
    EXINT6_7_IRQn                                 =   19, /* EXINT6_7_IRQ */
    EXINT8_IRQn                                   =   20, /* EXINT8_IRQ */
    EXINT12_13_IRQn                               =   22, /* EXINT12_13_IRQ */
    EXINT15_IRQn                                  =   23, /* EXINT15_IRQ */
    BT0_4_IRQn                                    =   24, /* BT0_4_IRQ */
    BT1_5_IRQn                                    =   25, /* BT1_5_IRQ */
    BT2_6_IRQn                                    =   26, /* BT2_6_IRQ */
    BT3_7_IRQn                                    =   27, /* BT3_7_IRQ */
    HDMICEC0_1_IRQn                               =   28, /* HDMICEC0_1_IRQ */
    SMCIF1_FLASHIF_IRQn                           =   29, /* SMCIF1_FLASHIF_IRQ */
    DSTC_IRQn                                     =   30, /* DSTC_IRQ */
} IRQn_Type;

#include "core_cm0plus.h"
#include <stdint.h>

/*******************************************************************************
* Device Specific Peripheral Registers structures
*******************************************************************************/
#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/*******************************************************************************
* ADC_MODULE
*******************************************************************************/
typedef struct stc_adc_adsr_field
{
        __IO   uint8_t  SCS                      :1;
        __IO   uint8_t  PCS                      :1;
        __IO   uint8_t  PCNS                     :1;
        __IO   uint8_t  RESERVED0                :3;
        __IO   uint8_t  FDAS                     :1;
        __IO   uint8_t  ADSTP                    :1;
} stc_adc_adsr_field_t;

typedef struct stc_adc_adcr_field
{
        __IO   uint8_t  OVRIE                    :1;
        __IO   uint8_t  CMPIE                    :1;
        __IO   uint8_t  PCIE                     :1;
        __IO   uint8_t  SCIE                     :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  CMPIF                    :1;
        __IO   uint8_t  PCIF                     :1;
        __IO   uint8_t  SCIF                     :1;
} stc_adc_adcr_field_t;

